<template><div><h3 id="小红书-深度学习推理-训练引擎实习生" tabindex="-1"><a class="header-anchor" href="#小红书-深度学习推理-训练引擎实习生"><span>小红书：深度学习推理/训练引擎实习生</span></a></h3>
<p>1.拷打项目 <br>
2.CUDA了解多少，用过什么。实现过什么，矩阵乘法，和标准库性能差多少<br>
3.CUDA优化和程序优化用过什么,共享内存，块展开。Intel SIMD指令。MPI,MPI是如何通信的<br>
4.多线程中常用什么库，pthread mutex,conditionvarible<br>
5.条件变量常用在什么方面，举例子。生产者消费者<br>
6.你举的例子中，互斥锁是用来干嘛的。答保护条件变量。错，是保持条件变量wait操作的原子性。<br>
7.C++多态，方式，重写重载，区别，用在什么方面。是否所有都可以重写和重载。八股开始<br>
8.模型压缩，量化基本原理，写个量化算法出来。然后细问<br>
9.优化器知道多少，有印象的就是sgd和adam<br>
10.Transformer 的结构，解码和编码，细微差异masked。qkv怎么来的。我弄成w_qkv那三个权重矩阵怎么来的了<br>
11.二叉树深度遍历，递归和非递归。非递归出现小问题。</p>
<h3 id="字节跳动-广告系统架构实习生" tabindex="-1"><a class="header-anchor" href="#字节跳动-广告系统架构实习生"><span>字节跳动：广告系统架构实习生</span></a></h3>
<p>1.拷打项目<br>
2.struct{char a, int b,short c}，求size 12<br>
3.C++新特性，lambda,右值，智能指针，类型模板<br>
4.unique_ptr和shared_ptr的区别，相关，shared引用计数，unique move所有权<br>
5.lambda 表达式如何捕获外部变量，函数返回值可以是lambda函数吗？，函数里lambda捕获了局部变量，局部变量生命周期是否会延长。（局部变量这个答错了，我答不会，编译器报错。实际会延长）。闭包的概念。<br>
6.进程线程的区别，线程会共享栈和堆吗。(这个答错了，堆是共享的，栈是隔离的)。线程什么时候用栈，什么时候用堆。<br>
7.栈和堆的地址空间，地址空间还有什么，栈和堆可以相遇吗。<br>
8.了解过C++中new的实现，内存分配的方法，new.堆上内存分配方案，new用的那个，最佳适配，还是下一次适配。除了new 以为还有什么内存分配器 malloc,realloc。别的malloc的实现。不同malloc库实现上有什么区别。<br>
9.协程了解过吗，用户级本身相对于线程有什么性能上的好处？<br>
10.计网相关mac 选址过程，ARP协议，目标ip，如何发给机器，如何发给局域网机器。<br>
11.子网的概念，192.168.开头的网络，是否用过抓包工具
12.http报文包含哪些部分<br>
13.git命令，merge  verbose的区别。没用过。自己用就clone,push,commit<br>
14.Linux,在文本文件中查关键字，有哪些方法，答grep。如果grep输出的内容特别多，我想慢点看用什么方法。答重定向到文件。那如何看文件，只能答head。用分页器，或者用awk,sed控制输出<br>
15.了解AWK命令吗。怎么去学去了解用法。<br>
16.手撕leetcode hard,n个链表翻转，中间部分写对了，首尾逻辑没处理好。</p>
<h3 id="卓驭-高性能计算实习生-ai引擎" tabindex="-1"><a class="header-anchor" href="#卓驭-高性能计算实习生-ai引擎"><span>卓驭：高性能计算实习生(AI引擎)</span></a></h3>
<p>什么都没问，就聊项目，但是一面挂。</p>
<h3 id="小米-深度学习训练框架优化工程师" tabindex="-1"><a class="header-anchor" href="#小米-深度学习训练框架优化工程师"><span>小米：深度学习训练框架优化工程师</span></a></h3>
<p>这个面试已过，拿了offer。但是没咋总结，等后面有时间总结一下</p>
</div></template>


